---
kind: method
id: M:Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.GetConstructionTypeIds
source: html/f5f8a5f4-52fe-c9c7-2d63-acd0cef8a602.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.GetConstructionTypeIds Method

The element ids of the ConceptualConstructionType's associated with this ConceptualSurfaceType.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetConstructionTypeIds()
```